src/templates/invoice-template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroLR.xsd"
                  xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroInformacion.xsd">
  <soapenv:Header/>
  <soapenv:Body>
    <sum:RegFactuSistemaFacturacion>
      <sum:Cabecera>
        <sum1:ObligadoEmision>
          <sum1:NombreRazon>{{EMISOR_NOMBRE}}</sum1:NombreRazon>
          <sum1:NIF>{{EMISOR_NIF}}</sum1:NIF>
        </sum1:ObligadoEmision>
      </sum:Cabecera>
      <sum:RegistroFactura>
        <sum1:RegistroAlta>
          <sum1:IDVersion>1.0</sum1:IDVersion>
          <sum1:IDFactura>
            <sum1:IDEmisorFactura>{{EMISOR_NIF}}</sum1:IDEmisorFactura>
            <sum1:NumSerieFactura>{{NUMERO}}</sum1:NumSerieFactura>
            <sum1:FechaExpedicionFactura>{{FECHA}}</sum1:FechaExpedicionFactura>
          </sum1:IDFactura>
          <sum1:NombreRazonEmisor>{{EMISOR_NOMBRE}}</sum1:NombreRazonEmisor>
          <sum1:TipoFactura>F1</sum1:TipoFactura>
          <sum1:DescripcionOperacion>{{DESCRIPCION}}</sum1:DescripcionOperacion>
          <sum1:Destinatarios>
            <sum1:IDDestinatario>
              <sum1:NombreRazon>{{RECEPTOR_NOMBRE}}</sum1:NombreRazon>
              <sum1:NIF>{{RECEPTOR_NIF}}</sum1:NIF>
            </sum1:IDDestinatario>
          </sum1:Destinatarios>
          <sum1:Desglose>
            <sum1:DetalleDesglose>
              <sum1:ClaveRegimen>01</sum1:ClaveRegimen>
              <sum1:CalificacionOperacion>S1</sum1:CalificacionOperacion>
              <sum1:TipoImpositivo>{{IVA}}</sum1:TipoImpositivo>
              <sum1:BaseImponibleOimporteNoSujeto>{{BASE}}</sum1:BaseImponibleOimporteNoSujeto>
              <sum1:CuotaRepercutida>{{CUOTA}}</sum1:CuotaRepercutida>
            </sum1:DetalleDesglose>
          </sum1:Desglose>
          <sum1:CuotaTotal>{{CUOTA}}</sum1:CuotaTotal>
          <sum1:ImporteTotal>{{TOTAL}}</sum1:ImporteTotal>
          <sum1:SistemaInformatico>
            <sum1:NombreRazon>{{EMISOR_NOMBRE}}</sum1:NombreRazon>
            <sum1:NIF>{{EMISOR_NIF}}</sum1:NIF>
            <sum1:NombreSistemaInformatico>enviafacturas.es</sum1:NombreSistemaInformatico>
            <sum1:IdSistemaInformatico>77</sum1:IdSistemaInformatico>
            <sum1:Version>1.0.03</sum1:Version>
            <sum1:NumeroInstalacion>383</sum1:NumeroInstalacion>
            <sum1:TipoUsoPosibleSoloVerifactu>S</sum1:TipoUsoPosibleSoloVerifactu>
            <sum1:TipoUsoPosibleMultiOT>N</sum1:TipoUsoPosibleMultiOT>
            <sum1:IndicadorMultiplesOT>N</sum1:IndicadorMultiplesOT>
          </sum1:SistemaInformatico>
          <sum1:FechaHoraHusoGenRegistro>{{TIMESTAMP}}</sum1:FechaHoraHusoGenRegistro>
          <sum1:TipoHuella>01</sum1:TipoHuella>
          <sum1:Huella>{{HUELLA}}</sum1:Huella>
          <!-- Marcador que será reemplazado por <ds:Signature> -->
          <sum1:SimulatedSignature>{{SIGNATURE}}</sum1:SimulatedSignature>
        </sum1:RegistroAlta>
      </sum:RegistroFactura>
    </sum:RegFactuSistemaFacturacion>
  </soapenv:Body>
</soapenv:Envelope>
